In [1]:
# import depend
import matplotlib.pyplot as plt
import pandas as pd
import numpy as np
import requests
import time
import json
import csv
from scipy import stats
from scipy.stats import linregress
from datetime import date
import scipy.stats as st
# output_data = ""
# import 
arrest_by_state = "Resources/Table_22_Arrest_by_State_2016.csv"
income_by_state = "Resources/h08.csv"

In [23]:
# create data frames for each data set. Make sure to use the same data frames throughout 
test_data = pd.read_csv("Resources/Table_22_Arrest_by_State_2016.csv")
test_data.head()

,State,Ages,Total\nall \nclasses1,Violent\ncrime2,Property\ncrime2,Murder and\nnonnegligent\nmanslaughter,Rape3,Robbery,Aggravated\nassault,Burglary,...,Driving\nunder the\ninfluence,Liquor\nlaws,Drunkenness4,Disorderly\nconduct,Vagrancy,All other\noffenses\n(except\ntraffic),Suspicion,Curfew\nand\nloitering\nlaw\nviolations,Number\nof\nagencies,2016\nestimated \npopulation
0,ALABAMA,Under 18,4800,321,1229,15,32,109,165,318,...,28,225,31,378,2,1096,0,0,240.0,3800629.0
1,ALABAMA,Total all ages,154482,6187,18479,312,384,1177,4314,3004,...,8126,2496,7283,2129,67,69052,0,0,NaN,NaN
2,ALASKA,Under 18,1893,216,494,8,21,35,152,104,...,31,121,18,11,0,269,0,12,32.0,738566.0
3,ALASKA,Total all ages,29462,2298,3495,41,130,282,1845,538,...,3063,775,112,738,4,11340,0,12,NaN,NaN
4,ARIZONA,Under 18,22997,1020,5113,15,53,336,616,759,...,211,1668,84,1436,65,2924,0,1061,90.0,6391343.0

In [21]:
test_data2 = pd.read_csv("Resources/h08.csv")
test_data2.head()

,State,2018,Unnamed: 2,2017 (40),Unnamed: 4,2017,Unnamed: 6,2016,Unnamed: 8,2015,...,1988,Unnamed: 66,1987 (21),Unnamed: 68,1986,Unnamed: 70,1985 (20),Unnamed: 72,1984 (19),Unnamed: 74
0,NaN,Median\nincome,Standard\nerror,Median\nincome,Standard\nerror,Median\nincome,Standard\nerror,Median\nincome,Standard\nerror,Median\nincome,...,Median\nincome,Standard\nerror,Median\nincome,Standard\nerror,Median\nincome,Standard\nerror,Median\nincome,Standard\nerror,Median\nincome,Standard\nerror
1,United States,"63,179",420,"61,136",322,"61,372",335,"59,039",436,"56,516",...,"27,225",139,"26,061",127,"24,897",129,"23,618",128,"22,415",102
2,Alabama,"49,936","2,423","50,865","1,094","51,113",845,"47,221","2,301","44,509",...,"19,948",912,"19,734","1,147","19,132",885,"18,333",760,"17,310",605
3,Alaska,"68,734","3,390","77,987","3,718","72,231","2,719","75,723","4,086","75,112",...,"33,103","1,183","33,233","1,497","31,356","1,017","34,782","1,089","32,356","1,473"
4,Arizona,"62,283","2,291","59,700","2,689","61,125","2,642","57,100","1,971","52,248",...,"26,435",843,"26,749",892,"25,500",718,"23,877",744,"21,425",609

In [19]:
new_df = test_data.loc[:,["State", "Ages", "Total\nall \nclasses1", "Violent\ncrime2", "Property\ncrime2", "Murder and\nnonnegligent\nmanslaughter", "Rape3", "Robbery", "Aggravated\nassault", "Burglary", "2016\nestimated \npopulation",]]
new_df

,State,Ages,Total\nall \nclasses1,Violent\ncrime2,Property\ncrime2,Murder and\nnonnegligent\nmanslaughter,Rape3,Robbery,Aggravated\nassault,Burglary,2016\nestimated \npopulation
0,ALABAMA,Under 18,4800,321,1229,15,32,109,165,318,3800629.0
1,ALABAMA,Total all ages,154482,6187,18479,312,384,1177,4314,3004,NaN
2,ALASKA,Under 18,1893,216,494,8,21,35,152,104,738566.0
3,ALASKA,Total all ages,29462,2298,3495,41,130,282,1845,538,NaN
4,ARIZONA,Under 18,22997,1020,5113,15,53,336,616,759,6391343.0
...,...,...,...,...,...,...,...,...,...,...,...
97,WEST VIRGINIA,Total all ages,39742,1905,5826,41,101,157,1606,771,NaN
98,WISCONSIN,Under 18,41813,1111,6135,7,149,434,521,655,5643675.0
99,WISCONSIN,Total all ages,261400,7556,31446,244,781,1570,4961,2771,NaN
100,WYOMING,Under 18,3332,22,558,0,2,3,17,46,549770.0
101,WYOMING,Total all ages,28213,500,2577,13,33,19,435,232,NaN

In [5]:
new_df = new_df.rename(columns={
    "Total\nall \nclasses1": "Total Cases"
})
new_df

             State            Ages  Total Cases
0        ALABAMA          Under 18         4800
1        ALABAMA    Total all ages       154482
2           ALASKA        Under 18         1893
3           ALASKA  Total all ages        29462
4          ARIZONA        Under 18        22997
..             ...             ...          ...
97   WEST VIRGINIA  Total all ages        39742
98       WISCONSIN        Under 18        41813
99       WISCONSIN  Total all ages       261400
100        WYOMING        Under 18         3332
101        WYOMING  Total all ages        28213

[102 rows x 3 columns]

In [7]:
# grab 2016 column from H08 
# rename header

In [8]:
income_df = test_data2.loc[:,["State", "2016"]]
income_df

             State            2016
0              NaN  Median\nincome
1    United States          59,039
2          Alabama          47,221
3           Alaska          75,723
4          Arizona          57,100
5         Arkansas          45,907
6       California          66,637
7         Colorado          70,566
8      Connecticut          75,923
9         Delaware          58,046
10            D.C.          70,982
11         Florida          51,176
12         Georgia          53,527
13          Hawaii          72,133
14           Idaho          56,564
15        Illinois          61,386
16         Indiana          56,094
17            Iowa          59,094
18          Kansas          56,810
19        Kentucky          45,369
20       Louisiana          42,196
21           Maine          50,856
22        Maryland          73,760
23   Massachusetts          72,266
24        Michigan          57,091
25       Minnesota          70,218
26     Mississippi          41,099
27        Missouri          55,016
28         Montana          57,075
29        Nebraska          59,374
30          Nevada          55,431
31   New Hampshire          76,260
32      New Jersey          68,468
33      New Mexico          48,451
34        New York          61,437
35  North Carolina          53,764
36    North Dakota          60,184
37            Ohio          53,985
38        Oklahoma          50,943
39          Oregon          59,135
40    Pennsylvania          60,979
41    Rhode Island          61,528
42  South Carolina          54,336
43    South Dakota          57,450
44       Tennessee          51,344
45           Texas          58,146
46            Utah          67,481
47         Vermont          60,837
48        Virginia          66,451
49      Washington          70,310
50   West Virginia          44,354
51       Wisconsin          59,817
52         Wyoming          57,829

In [13]:
income_df = income_df.dropna()

In [14]:
updated_income = income_df.rename(columns={
    "2016": "2016 Median Household Income"
})
updated_income

             State 2016 Median Household Income
1    United States                       59,039
2          Alabama                       47,221
3           Alaska                       75,723
4          Arizona                       57,100
5         Arkansas                       45,907
6       California                       66,637
7         Colorado                       70,566
8      Connecticut                       75,923
9         Delaware                       58,046
10            D.C.                       70,982
11         Florida                       51,176
12         Georgia                       53,527
13          Hawaii                       72,133
14           Idaho                       56,564
15        Illinois                       61,386
16         Indiana                       56,094
17            Iowa                       59,094
18          Kansas                       56,810
19        Kentucky                       45,369
20       Louisiana                       42,196
21           Maine                       50,856
22        Maryland                       73,760
23   Massachusetts                       72,266
24        Michigan                       57,091
25       Minnesota                       70,218
26     Mississippi                       41,099
27        Missouri                       55,016
28         Montana                       57,075
29        Nebraska                       59,374
30          Nevada                       55,431
31   New Hampshire                       76,260
32      New Jersey                       68,468
33      New Mexico                       48,451
34        New York                       61,437
35  North Carolina                       53,764
36    North Dakota                       60,184
37            Ohio                       53,985
38        Oklahoma                       50,943
39          Oregon                       59,135
40    Pennsylvania                       60,979
41    Rhode Island                       61,528
42  South Carolina                       54,336
43    South Dakota                       57,450
44       Tennessee                       51,344
45           Texas                       58,146
46            Utah                       67,481
47         Vermont                       60,837
48        Virginia                       66,451
49      Washington                       70,310
50   West Virginia                       44,354
51       Wisconsin                       59,817
52         Wyoming                       57,829

In [ ]:
#test